<template>
	<section class="popular-questions-area">
		<DefaultSectionHeader style="height: 40px;"
		text="<span style='color: #FF3D00;'>Популярные вопросы</span>, которыми часто задаются наши клиенты"/>
		<InformationDropList :items="items" theme="white" />
	</section>
</template>

<script>
import DefaultSectionHeader from '~/components/SectionHeaders/DefaultSectionHeader.vue';

export default {
	components: {
		DefaultSectionHeader,
	},
	data() {
		return {
			items: [
				{
					title: {
						desktop: 'Имеется ли доставка?',
						phone: 'Имеется ли доставка?'
					}, 
					description: {
						desktop: [
							`Да, имеется.`,

							`Доставка осуществляется всеми доступными логистическими компаниями.`,
						],
						phone: [
							`Да, имеется.`,

							`Доставка осуществляется доступными 
							логистическими компаниями.`
						]
					}	
				},
				{
					title: {
						desktop: 'Имеется ли партнерская скидка?',
						phone: 'Имеется ли партнерская скидка?',
					},
					description: {
						desktop: [
							`Да, имеется.`,

							`Партнерская скидка предоставляется гибкими условиями, которые определяются индивидуально.`
						],
						phone: [
							`Да, имеется.`,

							`Партнерская скидка предоставляется 
							гибкими условиями, которые 
							определяются индивидуально.`
						]
					}
				},
				{
					title: {
						desktop: 'Какое количество удлинителей необходимо для приобретения?',
						phone: `Какое количество удлинителей 
								необходимо для приобретения?`
					},
					description: {
						desktop: [
							`Индивидуально.`,

							`Минимальное количество удлинителей для заказа, составляет от одного удлинителя.`
						],
						phone: [
							`Индивидуально.`,

							`Минимальное количество удлинителей 
							для осуществления полного заказа, 
							составляет один удлинитель.`
						]
					}	
				},
				{
					title: {
						desktop: 'Какое количество дней необходимо для изготовления?',
						phone: `Какое количество дней 
								необходимо для изготовления?`
					},
					description: {
						desktop: [
							`Индивидуально.`,

							`Минимальное количество дней для осуществления заказа, составляет от одного рабочего дня.`,

							`Но, благодаря складским программам снабжения, имеется возможность отгрузки заказа в день обращения.`
						],
						phone: [
							`Индивидуально.`,

							`Минимальное количество дней 
							для осуществления полного заказа, 
							составляет один день.`
						]
					}
					
				},
			]
		}
	}
}
</script>

<style scoped>
.popular-questions-area {
	width: 100%;
	margin-top: 100px;

	display: inline-flex;
	flex-direction: column;
	gap: 20px;
}
</style>