<template>
	<section class="interesting-nuansions-area">
		<DefaultSectionHeader text="<span style='color: #FF3D00;'>Интересные нюансы</span>, которые важно знать вашим клиентам"/>
		<InformationDropList :items="items" theme="black" />
	</section>
</template>

<script>
import DefaultSectionHeader from '~/components/SectionHeaders/DefaultSectionHeader.vue';

export default {
	components: {
		DefaultSectionHeader,
	},
	data() {
		return {
			items: [
				{
					title: 'Причина использования удлинителя с размотанным кабелем', 
					description: [
						`Главная и основная причина, это защита от перегрева кабеля удлинителя.`,

						`Когда к удлинителю подключена нагрузка свыше 50% от выдерживаемой мощности удлинителя, кабель нагревается. 
						Когда кабель полностью размотан, то оттоку тепла, ничего не мешает “уходить” в окружающей среде.
						Но, когда кабель не размотан полностью, то он начинает нагревать сам себя, поэтому кабель изнашивается. `,
					]
				},
				{
					title: 'Причина использования удлинителя с определенным оборудованием',
					description: [
						`Главная и основная причина, это безопасная и продолжительная служба удлинителя.`,

						`Поэтому важно заранее определить перечень оборудования, которые собираетесь использовать с помощью удлинителя, 
						также, посчитать суммарно их мощность, которая не должна превышать мощность удлинителя.
						Предел мощности удлинителя можно определить по максимальному току нагрузки.`
					]
				},
				{
					title: 'Разница защиты «IP20» и «IP44», применимая на удлинителях, производимые компанией «ТОРЭЛЕКТРО»',
					description: [
						`«IP20», это базовый уровень защиты в удлинителях, которая не имеет защиты от пыли и влаги.`,

						`«IP44-», это повышенный уровень защиты в удлинителях, которая определена защитными крышками в розетках удлинителя.`
					]
				},
				{
					title: 'Разница сила тока «10А» и «16А», применимая на удлинителях, производимые компанией «ТОРЭЛЕКТРО»',
					description: [
						`Розетки обычно определены на сил тока «10А» и «16А», и чем выше этот показатель, тем мощнее окно использования.`,

						`Приблизительно суммарная мощность подключенного оборудования при «10А» не более 2.2 кВт, при «16А» не более 3.5 кВт.`
					]
				},
			]
		}
	}
}
</script>

<style scoped>
.interesting-nuansions-area {
	width: 100%;
	margin-top: 100px;

	display: inline-flex;
	flex-direction: column;
	gap: 20px;
}
</style>