<template>
	<section class="interesting-nuansions-area">
		<DefaultSectionHeader class="interesting-nuansions-header_desktop" text="<span style='color: #FF3D00;'>Интересные нюансы</span>, которые важно знать вашим клиентам"/>
		<DefaultSectionHeader class="interesting-nuansions-header_phone" text="<span style='color: #FF3D00;'>Интересные нюансы</span>, которыми <br/> интересуются ваши клиенты"/>
		<InformationDropList :items="items" theme="black" />
	</section>
</template>

<script>
import DefaultSectionHeader from '~/components/SectionHeaders/DefaultSectionHeader.vue';

export default {
	components: {
		DefaultSectionHeader,
	},
	data() {
		return {
			items: [
				{
					title: {
						ipad: 'Причина использования удлинителя с размотанным кабелем',
						desktop: 'Причина использования удлинителя с размотанным кабелем', 
						phone: `Использование удлинителя 
								с размотанным кабелем`
					},
					description: {
						desktop: 
							[
							`Главная и основная причина, это защита от перегрева кабеля удлинителя.`,

							`Когда к удлинителю подключена нагрузка свыше 50% от выдерживаемой мощности удлинителя, кабель нагревается. 
							Когда кабель полностью размотан, то оттоку тепла, ничего не мешает “уходить” в окружающей среде.
							Но, когда кабель не размотан полностью, то он начинает нагревать сам себя, поэтому кабель изнашивается. `,
							],
						phone: [
							`Главная причина, это надежная защита 
							удлинителя от перегрева кабеля. `,

							`Когда к удлинителю подключена 
							нагрузка свыше 50% от выдерживаемо 
							мощности, кабель нагревается. 
							Когда кабель полностью размотан, 
							то оттоку тепла, ничего не мешает 
							“уходить” в окружающей среде.
							Но, когда кабель не размотан 
							полностью, то он начинает нагревать 
							сам себя, кабель изнашивается. `
						],
						ipad: [
							`Главная причина, это надежная защита удлинителя от перегрева кабеля.`,

							`Если к удлинителю подключена нагрузка свыше 50%, кабель нагревается. 
							Если кабель полностью размотан, то тепло рассеивается в среде. 
							Если же кабель не размотан полностью, то следовательно, дополнительно 
							изнашивается, что может привести к «ситуациям».`
						]
					}
				},
				{
					title: {
						ipad: 'Причина использования удлинителя с определенным оборудованием',
						desktop: 'Причина использования удлинителя с определенным оборудованием',
						phone: `Использование удлинителя 
								с определенным оборудованием`
					},
					description: {
						desktop: 
						[
							`Главная и основная причина, это безопасная и продолжительная служба удлинителя.`,

							`Поэтому важно заранее определить перечень оборудования, которые собираетесь использовать с помощью удлинителя, 
							также, посчитать суммарно их мощность, которая не должна превышать мощность удлинителя.
							Предел мощности удлинителя можно определить по максимальному току нагрузки.`
						],
						phone: [
							`Главная причина, это безопасная 
							и продолжительная служба удлинителя.`,

							`Поэтому важно заранее определить 
							перечень оборудования, которые 
							собираетесь использовать с помощью 
							удлинителя, а также, посчитать 
							суммарно их мощность, 
							которая не должна превышать 
							мощность удлинителя.
							Предел мощности удлинителя можно 
							определить по максимальному току.`
						],
						ipad: [
							'Главная причина, это безопасная и продолжительная служба удлинителя.',

							`Поэтому важно заранее определить перечень оборудования, которые 
							собираетесь использовать с помощью удлинителя, а также, посчитать 
							суммарно их мощность, которая не должна превышать мощность удлинителя.
							Предел мощности удлинителя можно определить по максимальному току.`
						]
					}
				},
				{
					title: {
						ipad: 'Разница защиты «IP20» и «IP44», применимая на удлинителях',
						desktop: 'Разница степени защиты «IP20» и «IP44», применимая на удлинителях, производимые компанией «ТОРЭЛЕКТРО»',
						phone: `Разница защиты «IP20» и «IP44»,
								применимая на удлинителях`
					},
					description: 
					{
						desktop: [
							`«IP20», это базовый уровень защиты в удлинителях, которая не имеет защиты от пыли и влаги.`,

							`«IP44-», это повышенный уровень защиты в удлинителях, которая определена защитными крышками в розетках удлинителя.`
						],
						phone: [
							`«IP20», это стандартный уровень 
							защиты в удлинителях, которая 
							определена безопасным корпусом.`,

							`«IP44», это повышенный уровень 
							защиты в удлинителях, которая 
							определена защитными крышками. `
						],
						ipad: [
							`«IP20», это стандартный уровень защиты, определен безопасным корпусом.`,

							`«IP44», это повышенный уровень защиты, определен защитными крышками.`
						]
					}
				},
				{
					title: {
						ipad: 'Разница сила тока «10А» и «16А», применимая на удлинителях',
						desktop: 'Разница сила тока «10А» и «16А», применимая на удлинителях, производимые компанией «ТОРЭЛЕКТРО»',
						phone: `Разница сила тока «10А» и «16А», 
								применимая на удлинителях`
					},
					description: {
						desktop: [
							`Розетки обычно определены на сил тока «10А» и «16А», и чем выше этот показатель, тем мощнее окно использования.`,

							`Приблизительно суммарная мощность подключенного оборудования при «10А» не более 2.2 кВт, при «16А» не более 3.5 кВт.`
						],
						phone: [
							`Розетки обычно определены на сил 
							тока «10А» и «16А», и чем выше этот 
							показатель, тем больше возможностей.`,

							`Приблизительно суммарная мощность 
							подключенного оборудования, 
							например, при «10А» не более 2.2 кВт, 
							при «16А» не более 3.5 кВт.`
						],
						ipad: [
							`Розетки обычно определены на силы тока «10А» и «16А», следовательно, 
							чем выше показатель, тем больше возможностей использования оборудования.`,

							`Приблизительно суммарная мощность подключенного оборудования, 
							например, при «10А» не более 2.2 кВт, при «16А» не более 3.5 кВт.`
						]
					}
				},
			]
		}
	}
}
</script>

<style scoped lang="scss">
.interesting-nuansions-area {
	width: 100%;
	margin-top: 100px;

	display: inline-flex;
	flex-direction: column;
	gap: 20px;
}

.interesting-nuansions-header {
	&_desktop {
		height: 40px;
	}
	&_phone {
		display: none;
	}
}

@media screen and (width < $ipad) {
	.interesting-nuansions-header {
		&_desktop {
			display: none;
		}
		&_phone {
			display: flex;
			height: 50px;
		}
	}
}
</style>